#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Наименование");
	Поля.Добавить("Код");
	Поля.Добавить("ДействуетНаОсновании");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Если  Данные.ДействуетНаОсновании <> "" Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Представление = Данные.Наименование + " (на основании " + Данные.ДействуетНаОсновании + ")";
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти